const About = () => {
    return (
        <div className="max-w-4xl mx-auto px-6 py-12">
            <h1 className="text-4xl font-bold text-center text-green-800 mb-6">О нас</h1>
            <p className="text-lg text-gray-700 mb-6">
                Добро пожаловать в <span className="font-semibold text-green-600">Nature`s Prophet</span> — ваш надежный магазин для всех нужд, связанных с природой и садоводством! Мы специализируемся на продаже высококачественных товаров для дома и сада, включая растения, садовый инвентарь, и аксессуары, которые помогут вам создавать и поддерживать свой уголок природы.
            </p>
            <p className="text-lg text-gray-700 mb-6">
                В <span className="font-semibold text-green-600">Nature`s Prophet</span> мы стремимся предложить только лучшие продукты, проверенные временем и любителями природы. Наши товары идеально подойдут для того, чтобы ваш дом и сад всегда были наполнены зеленью, а уход за растениями стал настоящим удовольствием.
            </p>
            <p className="text-lg text-gray-700 mb-6">
                Мы гордимся нашим подходом к экологии и заботимся о каждом клиенте, предоставляя высококачественное обслуживание и персонализированные советы по выбору продукции. Мы верим в силу природы и стремимся помочь каждому раскрыть потенциал его зеленого уголка.
            </p>
            <h3 className="text-xl font-semibold text-gray-800 mb-4">Почему выбирают нас?</h3>
            <p className="text-lg text-gray-700 mb-4">
                Мы не просто магазин — мы ваш партнер в создании идеального зеленого уголка! В нашем ассортименте вы найдете все для сада, дома и балкона, от растений до специализированных инструментов. Мы всегда готовы помочь вам с выбором, предоставить профессиональные рекомендации и обеспечить обслуживание на высоком уровне.
            </p>
            <p className="text-lg text-gray-700">
                Мы ценим каждого клиента и стремимся, чтобы ваш опыт покупок был максимально удобным и приятным. Если у вас есть вопросы или вам нужна помощь, не стесняйтесь обращаться к нам. Мы всегда на связи и готовы помочь!
            </p>
        </div>
    )
}

export default About;
