const About = () => {
  return (
    <div className="max-w-4xl mx-auto px-6 py-12">
      <h1 className="text-4xl font-bold text-center text-green-800 mb-6">
        Про нас
      </h1>
      <p className="text-lg text-gray-700 mb-6">
        Ласкаво просимо до{" "}
        <span className="font-semibold text-green-600">Nature`s Prophet</span> —
        вашого надійного магазину для всіх потреб, повʼязаних із природою та
        садівництвом! Ми спеціалізуємося на продажу високоякісних товарів для
        дому та саду, зокрема рослин, садового інвентарю та аксесуарів, які
        допоможуть вам створити та підтримувати власний зелений куточок.
      </p>
      <p className="text-lg text-gray-700 mb-6">
        У <span className="font-semibold text-green-600">Nature`s Prophet</span>{" "}
        ми прагнемо пропонувати лише найкращі продукти, перевірені часом та
        любителями природи. Наші товари ідеально підходять для того, щоб ваш дім
        і сад завжди були наповнені зеленню, а догляд за рослинами приносив
        задоволення.
      </p>
      <p className="text-lg text-gray-700 mb-6">
        Ми пишаємося нашим екологічним підходом і дбаємо про кожного клієнта,
        надаючи якісне обслуговування та персоналізовані поради щодо вибору
        продукції. Ми віримо в силу природи і прагнемо допомогти кожному
        розкрити потенціал свого зеленого простору.
      </p>
      <h3 className="text-xl font-semibold text-gray-800 mb-4">
        Чому обирають нас?
      </h3>
      <p className="text-lg text-gray-700 mb-4">
        Ми — не просто магазин, ми ваш партнер у створенні ідеального зеленого
        куточка! У нашому асортименті ви знайдете все для саду, дому та балкону
        — від рослин до спеціалізованих інструментів. Ми завжди готові допомогти
        вам з вибором, надати професійні рекомендації та забезпечити високий
        рівень обслуговування.
      </p>
      <p className="text-lg text-gray-700">
        Ми цінуємо кожного клієнта і прагнемо зробити ваш досвід покупок
        максимально зручним і приємним. Якщо у вас є запитання або вам потрібна
        допомога — не соромтеся звертатися до нас. Ми завжди на зв’язку і готові
        допомогти!
      </p>
    </div>
  );
};

export default About;
